app/controllers/account_activations_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "federico@ciao.it"], ["LIMIT", 1]]
---
    def edit
        user = User.find_by(email: params[:email])