app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Beyoncé is a legend."], ["user_id", 1], ["created_at", "2017-08-04 13:04:43.941426"], ["updated_at", "2017-08-04 13:04:43.941426"]]
---
    def create
        @micropost = current_user.microposts.build(micropost_params)
        if @micropost.save

DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 302]]
---
    def destroy
        @micropost.destroy