app/controllers/password_resets_controller.rb

    def create
        @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]

    def update
        if params[:user][:password].empty?                  # Case (3)
            @user.errors.add(:password, "can't be empty")
            render 'edit'
        elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$UmF5RPI08IlSknWFnWxCkudxoOVY.BCwWNbT8BnxfkuNFnr.DbIpW"], ["updated_at", "2017-08-03 14:40:51.633008"], ["id", 762146111]]